## Mac OS Brew Essentials

# Taps
tap "bazelbuild/tap"
tap "datawire/blackbird"
tap "derailed/k9s"
tap "graalvm/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jenkins-x/jx"
tap "johanhaleby/kubetail"
tap "mongodb/brew"
tap "pingcap/brew"
tap "yonaskolb/xcodegen", "https://github.com/yonaskolb/XcodeGen.git"

# Install DevTools
brew "git-extras"
brew "git-flow-avh"
brew "git-town"
brew "gitlab-runner", restart_service: true
brew "protobuf"
brew "skaffold"
brew "mkdocs"
brew "krakend"

# DevOps / Cloud / K8S
brew "awscli"
brew "azure-cli"
brew "openshift-cli"
brew "ansible"
brew "terraform"
cask "minishift"
cask "docker"
brew "docker-credential-helper-ecr"
brew "docker-machine", link: false
brew "docker-machine-driver-xhyve"
brew "dive"
brew "lazydocker"
brew "kubectx"
brew "johanhaleby/kubetail/kubetail"
brew "derailed/k9s/k9s"
brew "fluxctl"
brew "helm@2"
brew "helmfile"
brew "jenkins-x/jx/jx"

# Monitoring / Dashboards / DB's
brew "grafana", restart_service: true
brew "influxdb"
brew "mysql-client"
brew "mongodb/brew/mongodb-community-shell"
brew "redis"
brew "mosquitto" #MQTT

# Build Tools
brew "ant"
brew "maven"
brew "bazel", link: false
brew "bazelisk"
cask "graalvm-ce-lts-java11"

# SSL / PGP
brew "certbot"
brew "mkcert"
brew "gnupg"
brew "pinentry-mac"
cask "keybase"

# Mobile Dev
brew "cocoapods"
brew "fastlane"
brew "carthage"
brew "xcodegen"
brew "fdk-aac"
brew "repo"

# Vector Graphics
brew "cairo"
brew "graphviz"
brew "gdk-pixbuf"
brew "asciinema"
brew "webp"

# OS extras
brew "fish"
brew "gcc"
brew "ctop"
brew "htop"
brew "libusb"
brew "dfu-util"
brew "diff-so-fancy"
brew "enscript"
brew "oniguruma"
brew "gobject-introspection"
brew "gsettings-desktop-schemas"
brew "gtk+"
brew "gtk+3"
brew "libogg"
brew "libvorbis"
brew "opus"
brew "x264"
brew "xvid"
brew "libvpx"
brew "llvm"
brew "exa" #https://formulae.brew.sh/formula/exa#default
brew "cmake"
brew "autojump" #https://formulae.brew.sh/formula/autojump#default
brew "bash"
brew "bash-completion"
brew "bash-git-prompt"
brew "hey"
brew "tldr"
brew "tree"
brew "watch"

# Network Tools
brew "libnet"
brew "ettercap"
brew "nmap"
brew "socat"
brew "httrack" #https://formulae.brew.sh/formula/httrack#default
brew "libffi"
brew "curl"
brew "httpie"
brew "wget"
brew "tmux"
brew "telnet"
brew "figlet" #https://formulae.brew.sh/formula/figlet#default

# Command-Line JOSN 
brew "fx"
brew "jq"

# Load Testing Framework
brew "k6"

brew "mackup" # OSX App Settings Backup

# Video Downloader
brew "movgrab"
brew "youtube-dl"

# Node / Python /Ruby Tools
brew "nvm"
brew "pyenv"
brew "rbenv"
brew "ruby"
brew "pcre2"

# Fonts
cask "font-meslo-lg-nerd-font"

# Video Conference
cask "zoom"
cask "webex"
cask "gotomeeting"
cask "skype-for-business"
cask "skype"

# OSX Apps introspection
cask "apparency"
cask "suspicious-package"

# Browsers
cask "firefox"
cask "google-chrome"

# Dev
cask "intellij-idea"
cask "sublime-text"
cask "postman"
cask "iterm2"

# QuickLook Add-ons
cask "betterzip"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklookase"
cask "webpquicklook"

# Chat
cask "whatsapp"
cask "telegram-desktop"
cask "slack"

# Misc
cask "rectangle"
cask "transmission"
cask "vlc"
cask "spotify"
cask "dropbox"
cask "adobe-acrobat-reader"
cask "osxfuse"
cask "keepingyouawake"
cask "cyberghost-vpn"

